//
//  TrainingDescriptionModel.swift
//  TrainingClass
//
//  Created by dzmitry on 17.03.23.
//

import Foundation

let trainingDescriptionOne = "ГРУДЬ, ДЕЛЬТЫ, ТРИЦЕПС, ПРЕСС \n⚫️ Жим гантелей на наклонной скамье 3*12 6️⃣ \n⚫️ Кроссовер в наклоне 3*15 6️⃣ \n⚫️ Тяга штанги к подбородку 3*10 6️⃣ \n⚫️ Махи гантелей в стороны 3*12 6️⃣ \n⚫️ Разгибание на трицепс с канатом 3*15 7️⃣ \n⚫️ Подъем корпуса на коврике 3*20 7️⃣"
let trainingDescriptionTwo = "СПИНА, ДЕЛЬТА, БИЦЕПС, НОГИ \n⚫️ Тяга верхнего блока 3*12 6️⃣ \n⚫️ Горизонтальная тяга в блоке 4*12 6️⃣ \n⚫️ Подъм гантелей сидя в наклоне 3*15 6️⃣ \n⚫️ Подъем штанги на бицепс стоя 3*12 6️⃣ \n⚫️ Гиперэкстензия 3*12 6️⃣ \n⚫️ Разгибания ног в тренажере 4*15 6️⃣"
let trainingDescriptionThree = "НОГИ, ДЕЛЬТЫ, ПРЕСС 6️⃣ \n⚫️ Разгибания ног в тренажере 4*15 7️⃣ \n⚫️ Жим платформы 3*10 5️⃣ \n⚫️ Сгибания ног в тренажере 3*12 6️⃣ \n⚫️ Жим гантелей сидя 3*12 5️⃣ \n⚫️ Махи гантелей в стороны 3*15 6️⃣ \n⚫️ Подъем ног на брусьях 3*15 6️⃣"
let trainingDescriptionFour = "ГРУДЬ, ДЕЛЬТЫ, ТРИЦЕПС \n⚫️ Жим гантелей 4х10 6️⃣ \n⚫️ Жим штанги под углом 3х12 6️⃣ \n⚫️ Сведение в наклоне 4х12-15 6️⃣ \n⚫️ Подъем к подбородку 3х12 6️⃣ \n⚫️ Разгибания в тренажере 3х12,15 7️⃣ \n⚫️ Подъем гантели за головой 4х10 6️⃣"
let trainingDescriptionFive = "СПИНА, БИЦЕПС, ПРЕСС \n⚫️ Подтягивания в гравитроне 3*12 6️⃣ \n⚫️ Тяга гантелей к поясу 3*12 6️⃣ \n⚫️ Подъем гантелей на бицепс (молотки) 3*10 6️⃣ \n⚫️ Подъем гантелей с разворотом 3*10 6️⃣ \n⚫️ Разводка верхних блоков в кроссовере 3*20 6️⃣ \n⚫️ Скручивания 3*20 7️⃣"
let trainingDescriptionSix = "НОГИ, ДЕЛЬТЫ, ПРЕСС \n⚫️ Разгибания в тренажере 3*15 6️⃣ \n⚫️ Приседания в Смите 4*10 5️⃣ \n⚫️ Жим платформы 3*12 5️⃣ \n⚫️ Вертикальный жим в блоке 3*12 6️⃣ \n⚫️ Махи гантелей в стороны 3*12 6️⃣ \n⚫️ Скручивания на скамье 3*15 6️⃣"
let trainingDescriptionSeven = "ГРУДЬ, ДЕЛЬТЫ, БИЦЕПС, ТРИЦЕПС \n⚫️ Сведение в блоке 3*15 7️⃣ \n⚫️ Жим в Смите под углом 3*10 7️⃣ \n⚫️ Тяга к подбородку 3*10 7️⃣ \n⚫️ Вынос гантелей поочередно 3*16 (общее количество) 7️⃣ \n⚫️ Молотки на бицепс 3*10 7️⃣ \n⚫️ Французский жим 3*10 7️⃣"
let trainingDescriptionEight = "СПИНА, БИЦЕПС БЕДРА, ПРЕСС \n⚫️ Тяга в тренажере к поясу 3*12 7️⃣ \n⚫️ Тяга гантелей к поясу 3*10 7️⃣ \n⚫️ Махи гантелей сидя в наклоне 3*20 7️⃣ \n⚫️ Тяга гантелей 3*10 6️⃣ \n⚫️ Сгибания в блоке 3*12 6️⃣ \n⚫️ Скручивания 3*20 8️⃣"
let trainingDescriptionNine = "НОГИ, ДЕЛЬТЫ, ТРИЦЕПС \n⚫️ Разгибания в тренажере 3*15 7️⃣ \n⚫️ Жим платформы 3*10 7️⃣ \n⚫️ Выпады вперед 3*20 7️⃣ \n⚫️ Жим сидя вверх 3*12 7️⃣ \n⚫️ Отжимания от пола 3*15 8️⃣ \n⚫️ Разгибания из-за головы в блоке 3*12 7️⃣"
let trainingDescriptionTen = "ГРУДЬ, ДЕЛЬТЫ, БИЦЕПС, ТРИЦЕПС \n⚫️ Жим в тренажере 3*15 7️⃣ \n⚫️ Жим гантелей на наклонной скамье 3*10 7️⃣ \n⚫️ Разводка гантелей на наклонной скамье 7️⃣ \n⚫️ Разгибания рук в нижнем блоке 3*12 7️⃣ \n⚫️ Молотки на бицепс 3*12 8️⃣ \n⚫️ Жим Арнольда 3*10 6️⃣"
let trainingDescriptionEleven = "СПИНА, ДЕЛЬТЫ, БИЦЕПС \n⚫️ Подтягивания в гравитроне 3*12 7️⃣ \n⚫️ Тяга верхнего блока 3*12 7️⃣ \n⚫️ Жим гантелей сидя 3*10 7️⃣ \n⚫️ Махи гантелей в стороны 3*12 8️⃣ \n⚫️ Сгибания на бицепс в тренажере Скотта 3*15 8️⃣ \n⚫️ Подъем на бицепс стоя с разворотом 3*12 8️⃣"
let trainingDescriptionTwelve = "НОГИ, ДЕЛЬТЫ, ПРЕСС \n⚫️ Разгибания в тренажере 3*15 8️⃣ \n⚫️ Выпады назад 3*20 7️⃣ \n⚫️ Зашагивания 3*10 на каждую ногу 7️⃣ \n⚫️ Жим сидя в тренажере 3*15 8️⃣ \n⚫️ Махи гантелей сидя в наклоне 3*15 8️⃣ \n⚫️ Подъем корпуса на скамье 3*20 8️⃣"
let trainingDescriptionThirteen = "ГРУДЬ, БИЦЕПС, ТРИЦЕПС \n⚫️ Жим гантелей на наклонной скамье 3*10 8️⃣ \n⚫️ Жим в Смите на наклонной скамье 4*12 8️⃣ \n⚫️ Молотки на бицепс сидя 3*10 8️⃣ \n⚫️ Разгибания с нижнего блока 3*12 8️⃣ \n⚫️ Подъем на бицепс сидя, ладонью вверх 3*12 8️⃣ \n⚫️ Разгибания с верхнего блока 3*12 8️⃣"

let scaleRPE = "ШКАЛА ВОСПРИНИМАЕМОГО НАПРЯЖЕНИЯ (RPE) \n  Чтобы увеличивать объем с пользой, необходимо регулировать интенсивность, оценивая усилие по 10-балльной шкале. \n10 - Предельное усилие (Нет повторений в запасе) \n9 - Крайне тяжело (Получится выполнить еще 1 повтор) \n8 - Тяжело (Получится выполнить еще 2 повтора) \n7 - Довольно напряженно (Получится выполнить еще 3 повтора) \n5, 6 - Комфортно (Получится выполнить еще 4-6 повторов) \n1, 4 - Легко (Воспринимается как разминка) \n Неделя 1: RPE 7 (в запасе 3 повтора) \n Неделя 2: RPE 7,5 (в запасе 2-3 повтора) \n Неделя 3: RPE 8 (в запасе 2 повтора) \n Неделя 4: RPE 8,5-9 (в запасе 1-2 повтора) "
