//
//  TrainingDescriptionModel.swift
//  TrainingClass
//
//  Created by dzmitry on 17.03.23.
//

import Foundation

let trainingDescriptionOne = "ГРУДЬ, ДЕЛЬТЫ, ТРИЦЕПС, ПРЕСС \n⚫️ Жим гантелей на горизонтальной скамье 3*12 6️⃣ \n⚫️ Жим гантелей на наклонной скамье 3*12 6️⃣ \n⚫️ Кроссовер в наклоне 3*15 6️⃣ \n⚫️ Тяга штанги к подбородку 3*10 6️⃣ \n⚫️ Махи гантелей в стороны 3*12 6️⃣ \n⚫️ Разгибание на трицепс с канатом 3*15 7️⃣ \n⚫️ Подъем корпуса на коврике 3*20 7️⃣"
let trainingDescriptionTwo = "СПИНА, ДЕЛЬТА, БИЦЕПС, НОГИ \n⚫️ Тяга верхнего блока 3*12 6️⃣ \n⚫️ Горизонтальная тяга в блоке 4*12 6️⃣ \n⚫️ Подъм гантелей сидя в наклоне 3*15 6️⃣ \n⚫️ Подъем штанги на бицепс стоя 3*12 6️⃣ \n⚫️ Гиперэкстензия 3*12 6️⃣ \n⚫️ Разгибания ног в тренажере 4*15 6️⃣"
let trainingDescriptionThree = "НОГИ, ДЕЛЬТЫ, ПРЕСС \n⚫️ Разгибания ног в тренажере 4*15 7️⃣ ⓻\n⚫️ Жим платформы 3*10 \n⚫️ Сгибания ног в тренажере 3*12 \n⚫️ Жим гантелей сидя 3*12 \n⚫️ Махи гантелей в стороны 3*15 \n⚫️ Подъем ног в тренажере 3*15"
let trainingDescriptionFour = "ГРУДЬ, ДЕЛЬТЫ, ТРИЦЕПС \n⚫️ Жим гантелей 4х10 \n⚫️ Жим штанги под углом 3х12 \n⚫️ Сведение в наклоне 4х12-15 \n⚫️ Подъем к подбородку 3х12 \n⚫️ Разгибания в тренажере 3х12,15 \n⚫️ Подъем гантели за головой 4х10"
let trainingDescriptionFive = "СПИНА, БИЦЕПС, ПРЕСС \n⚫️ Подтягивания в гравитроне 3*12 \n⚫️ Тяга гантелей к поясу 3*12 \n⚫️ Подъем гантелей на бицепс (молотки) 3*10 \n⚫️ Подъем гантелей с разворотом 3*10 \n⚫️ Разводка верхних блоков в кроссовере 3*20 \n⚫️ Скручивания 3*20"
let trainingDescriptionSix = "НОГИ, ДЕЛЬТЫ, ПРЕСС \n⚫️ Разгибания в тренажере 3*15 \n⚫️ Приседания в Смите 4*10 \n⚫️ Жим платформы 3*12 \n⚫️ Вертикальный жим в блоке 3*12 \n⚫️ Махи гантелей в стороны 3*12 \n⚫️ Скручивания на скамье 3*15"
let trainingDescriptionSeven = "ГРУДЬ, ДЕЛЬТЫ, БИЦЕПС, ТРИЦЕПС \n⚫️ Сведение в блоке 3*15 \n⚫️ Жим в Смите под углом 3*10 \n⚫️ Тяга к подбородку 3*10 \n⚫️ Вынос гантелей поочередно 3*16 (общее количество) \n⚫️ Молотки на бицепс 3*10 \n⚫️ Французский жим 3*10"
let trainingDescriptionEight = "СПИНА, БИЦЕПС БЕДРА, ПРЕСС \n⚫️ Тяга в тренажере к поясу 3*12 \n⚫️ Тяга гантелей к поясу 3*10 \n⚫️ Махи гантелей сидя в наклоне 3*20 \n⚫️ Тяга гантелей 3*10 \n⚫️ Сгибания в блоке 3*12 \n⚫️ Скручивания 3*20"
let trainingDescriptionNine = "НОГИ, ДЕЛЬТЫ, ТРИЦЕПС \n⚫️ Разгибания в тренажере 3*15 \n⚫️ Жим платформы 3*10 \n⚫️ Выпады вперед 3*20 \n⚫️ Жим сидя вверх 3*12 \n⚫️ Отжимания от пола 3*15 \n⚫️ Разгибания из-за головы в блоке 3*12"
let trainingDescriptionTen = "ГРУДЬ, ДЕЛЬТЫ, БИЦЕПС, ТРИЦЕПС \n⚫️ Жим в тренажере 3*15 \n⚫️ Жим гантелей на наклонной скамье 3*10 \n⚫️ Разводка гантелей на наклонной скамье \n⚫️ Разгибания рук в нижнем блоке 3*12 \n⚫️ Молотки на бицепс 3*12 \n⚫️ Жим Арнольда 3*10"
let trainingDescriptionEleven = "СПИНА, ДЕЛЬТЫ, БИЦЕПС \n⚫️ Подтягивания в гравитроне 3*12 \n⚫️ Тяга верхнего блока 3*12 \n⚫️ Жим гантелей сидя 3*10 \n⚫️ Махи гантелей в стороны 3*12 \n⚫️ Сгибания на бицепс в тренажере Скотта 3*15 \n⚫️ Подъем на бицепс стоя с разворотом 3*12"
let trainingDescriptionTwelve = "НОГИ, ДЕЛЬТЫ, ПРЕСС \n⚫️ Разгибания в тренажере 3*15 \n⚫️ Выпады назад 3*20 \n⚫️ Зашагивания 3*10 на каждую ногу \n⚫️ Жим сидя в тренажере 3*15 \n⚫️ Махи гантелей сидя в наклоне 3*15 \n⚫️ Подъем корпуса на скамье 3*20"
let trainingDescriptionThirteen = "ГРУДЬ, БИЦЕПС, ТРИЦЕПС \n⚫️ Жим гантелей на наклонной скамье 3*10 \n⚫️ Жим в Смите на наклонной скамье 4*12 \n⚫️ Молотки на бицепс сидя 3*10 \n⚫️ Разгибания с нижнего блока 3*12 \n⚫️ Подъем на бицепс сидя, ладонью вверх 3*12 \n⚫️ Разгибания с верхнего блока 3*12"

